<?
function totranslit($var, $lower = true, $punkt = true) {
	global $langtranslit;
	
	if ( is_array($var) ) return "";

	if (!is_array ( $langtranslit ) OR !count( $langtranslit )) {

		$langtranslit = array(
		'à' => 'a', 'á' => 'b', 'â' => 'v',
		'ã' => 'g', 'ä' => 'd', 'å' => 'e',
		'¸' => 'e', 'æ' => 'zh', 'ç' => 'z',
		'è' => 'i', 'é' => 'y', 'ê' => 'k',
		'ë' => 'l', 'ì' => 'm', 'í' => 'n',
		'î' => 'o', 'ï' => 'p', 'ð' => 'r',
		'ñ' => 's', 'ò' => 't', 'ó' => 'u',
		'ô' => 'f', 'õ' => 'h', 'ö' => 'c',
		'÷' => 'ch', 'ø' => 'sh', 'ù' => 'sch',
		'ü' => '', 'û' => 'y', 'ú' => '',
		'ý' => 'e', 'þ' => 'yu', 'ÿ' => 'ya',
		"¿" => "yi", "º" => "ye",
		
		'À' => 'A', 'Á' => 'B', 'Â' => 'V',
		'Ã' => 'G', 'Ä' => 'D', 'Å' => 'E',
		'¨' => 'E', 'Æ' => 'Zh', 'Ç' => 'Z',
		'È' => 'I', 'É' => 'Y', 'Ê' => 'K',
		'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N',
		'Î' => 'O', 'Ï' => 'P', 'Ð' => 'R',
		'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U',
		'Ô' => 'F', 'Õ' => 'H', 'Ö' => 'C',
		'×' => 'Ch', 'Ø' => 'Sh', 'Ù' => 'Sch',
		'Ü' => '', 'Û' => 'Y', 'Ú' => '',
		'Ý' => 'E', 'Þ' => 'Yu', 'ß' => 'Ya',
		"¯" => "yi", "ª" => "ye",
		);

	}
}
?>